
s = '¹÷É´¹Ò®¾¤¦ò¤®¾¤µÈ¾¤Â©¨¡¾­¨ö­®¾¤¦ò¤®¾¤µÈ¾¤Ã¦È'
# s = '¡¾­²½­ñ­¢ñ­ªÒ, ²½­ñ­, ¦ò¤¢º¤ê†Ã§ÉÃ­¡¾­²½­ñ­'
s = 'À»ñ©Ã¹ÉÁª¡, À»ñ©Ã¹ÉÀ², À»ñ©Ã¹É¹ñ¡, À»ñ©Ã¹ÉÃ§É®ÒÄ©É'
s = '¦ô®ªÒ, µøÈªÒ, ´óµøÈ, ª˜¤µøÈ'
s = 'ªó, À£¾½, ¥ñ¤¹¸½, ¡¾­Àª˜­,-ຊະນະ'
s = 'À»ñ©Ã¹ÉÀ¡ó©¦ó, À»ñ©Ã¹ÉÀ¯ñ­¦ó'
# for i in range(161, 255):
#     print(chr(i))
#     if i in s_lao_map_uc:
#         print("======> ", s_lao_map_uc[i])

def converter(c):
    s_lao_map_uc = {
        155 : "ດ", 156 : "ຕ", 157 : "ຖ", 158 : "$", 159 : "ນ", 160 : "ບ", 161 : "ປ",
        160 : "$", 161 : "ກ", 162 : "ຂ", 163 : "ຄ", 164 : "ງ", 165 : "ຈ", 166 : "ສ", 167 : "ຊ", 168 : "ຍ", 169 : "ດ", 170 : "ຕ", 171 : "ຖ", 172 : "$", 173 : "ນ", 174 : "ບ", 175 : "ປ",
        176 : "ຜ", 177 : "ຝ", 178 : "ພ", 179 : "ຟ", 180 : "ມ", 181 : "ຢ", 182 : "$", 183 : "$", 184 : "ວ", 185 : "ຫ", 186 : "ອ", 187 : "ຮ", 188 : "ຽ", 189 : "ະ", 190 : "າ", 191 : "ໍາ",
        192 : "ເ", 193 : "ແ", 194 : "ໂ", 195 : "ໃ", 196 : "ໄ", 197 : "ໆ", 198 : "ຯ", 199 : "$", 200 : "່", 201 : "້", 202 : "໊", 203 : "໋", 204 : "໌", 205 : "ຫຼ", 206 : "ໜ", 207 : "$",
        208 : "ຸ", 209 : "ູ", 210 : "ໍ່", 211 : "ໍ້", 212 : "ໍ່າ", 213 : "ໍ້າ", 214 : "ໍ", 215 : "ັ", 216 : "ິ", 217 : "ີ", 218 : "ຶ", 219 : "ື", 220 : "ົ", 221 : "ຸ", 222 : "ູ", 223 : "$",
        224 : "0", 225 : "$", 226 : "$", 227 : "$", 228 : "$", 229 : "$", 230 : "$", 231 : "$", 232 : "$", 233 : "$", 234 : "ທ", 235 : "ຣ", 236 : "ລ", 237 : "ົ້", 238 : "$", 239 : "$",
        240 : "ໍ", 241 : "ັ", 242 : "ິ", 243 : "ີ", 244 : "ຶ", 245 : "ື", 246 : "ົ", 247 : "ຸ", 248 : "ູ", 249 : "ຼ", 250 : "່", 251 : "້", 252 : "໊", 253 : "໋", 254 : "໌", 255 : "$"}
    
    return s_lao_map_uc[ord(c)] if ord(c) in s_lao_map_uc else c

with open(r'c:/Users/Phanakhone/Desktop/lao_converter/todo.txt', 'r', encoding='utf-8') as f:
    data = f.read().splitlines()

for i in data:
    for c in i:
        print(converter(c), end='')

    if converter(c) == "$":
        print(ord(c),"============")

    print()

